node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866910994052887
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866910994052887
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 4013915
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "\201\301\001\276\270\371Z\276\216\327\313\275$%!<W\303\274\275{?s\274\350\273~<bu\337\274\010\034Z\275N\024 \275^\2112\276\330\350\001\275\336\202\244=0$y\274\033\257\264\275.\212\276=\201\362/\276\025|9=\234\202\\\275\036\232T=\301A\207\276\211\365T:\254Z\343\275\321_(=c\321M\276\004o)\276*\356\200\275\204\033\026:\014p\341\274\233\300\333\275\3573\010>c;\217=\254D\r=g\260\223>\265\036\316\275(\031\215\272\033\"-\276^\002\343\275\242\274\272\274\000\271*>\014\023\246=\213\253\201=t\262*>o\225\267\275\200~\246> &\014:=\241\"\276j\n\212>\246\206q\276\376\337\351\275=\243\202>l7\341;\355\3067\274\353[\336=\032\365\316\274\224\215\217\275\327\255\025\275-\307T>\303\214\027\276\275\337\303\274\013k\302\275\003t\323=\005D\265\275\266E\014=\337\352\234<\034\367\216=\026\273>\274\202\357@\274\313T\334\274^\274\364=\341\2222=\'\022n\276/\021N>\347X\204\275\032\t\002=\001\237\007\276\205,\313:\215\325I>\220\267\202\276D \373=\301g\013<\377\302\372=\227l\225=\025\'\036>\220<x\2758\353\372=Bb\351\274ff&>\300\223b=\251\312^\275/\216\344=\221\237\230;]\013\216=\177\205\236\275\375\244/>\007\204\345=\367\227\033=L_\200<\3475\362<\262\247W\276\227\232\275=/\300\266>7\240\352=\341\233y=\377Y\256\274\236\364&\276(\013\266=\250 0>m\006\371\271\337H&>\243`\214<~;\203\276\371\201\300\274>\240\"\276\220?H\272\"<|>\302\016\026>\361\033\203>\205\r\n>,\372Z\275r\030\334\275\201=\032\276\304\024\267\273\345\037\323\275\236T\016>2\260t>\371\343H\276\256\263\334<tk\222<K\026\021>\203\261\001\2769\354\225\275\017\022\202\276u\004\334=N\014\365\275\321\210\024\276o\344\020>\344G\207\276\206\334\230\275\234\3715\276\243eA\275nG\277\274i\023\362=\207\007y=\201\242T\276zV\251\275\032\230t=30\321\275o\253+\275\2034\367=\224*\357=Lx\347==\2049\276dK\013=i\2064\276\002\312\203\275\240-3\275 \t\250=\001\261\022>\346\363\233\275o\267l>B\027@>4\272\222=\206\010E\2746\207[\275\310!9=\360\021j\276{\022Z\276\235\374\004>v|d>)\327\202=HN\003\276\376\267\320=\000X\276\275\372\022J\275+y\274\275Ir\314\275rY\217\271\312\305\203=E\253\222<\311\365\001<G\027\210\276yt\334\272\"\344\324=Bf\226\275\007KP<\206F\246=\323\023\'\275\316\"\033\276\"\317\266=\275\265\254\275\013\2263\275t\213\323<\371\330\355\274\354\257&>f\200\001<\227FN\275\272\321\330\273\201\206\202<2\032\202>\002I\343=\2434\332=\013\307H\276\356\376\020> !\r>l\211#=\002\255\373=\246\'\177=1\177b>>\177P>`\256\030>\001\241\215\276\210\234r\276\370,*\275\354\275\353<\325\023\223=+oT\274Z\rX\275\177Ul>\276>A=\001\366\356=\226Pd\275\361\007\330=\304|\364\275M\345?\276\334\201\304<@N\223<\344\331K\275J\354\327\275\004\226\333;\255$\235<\327Q&>\277I@>|\266s\2764\371\227>\264\250\341\275\201\320\255\275\235k\327<\345c\007\276\351\037\372;\263\243\371<\345\247\204>M\246A\275\241\214y=Y\002\322=\2505A\276\346\254\300\275!\000\263;\312s\234\276\270u\205\275\332\313\n>j\307\037\276~\337$\276\203\277\231\275\016s\304\275\322\004 \276d\201\312\275]\201\310\275\2766\263=2\255\037\276\323{\032\275\202\2436>!\3773\276x,_\275\222\231A<;\013\023\275\204k\327=\264 E\275\007\026\200<\212\031B=\210G->!\030r\275\036\023\270=L\237\240=\001\304\375\274\274(\231<\'\024_\276\214\334\235\276\320r%>\004\n\316=\301g5\275\026KD\276\3160\305= M\007\276n6\022\275\037\350-\276aM\362\275C\004B=m\321\027>n\306\375=\"\253l\275\200\314\277=\t^\205\276\037\214\333\275\215\311\"\275\245\321 =\317\203\373=\304L\001=\376\302T>\372\320\236\274|\347m=\276\277\363<h\201&<\252>\240=\267\205\356\275\325K\260=\264\177\002\276n\364L\274\316\260b>\304!\370\275\214{-\275P\325\313=\351C\177>\366\250$\274_[)\276\004c\324\275\223\245H=i/\202\272\213\305\027\276Z\020\303=\010q\316\275Y\024\033>cQ*=\023\2317>R\347\211>\023\360\216\274QK\367<I\277\247\275\007\345\331\275~\333\255<CQ\320=\016\255\377=1s\303\276H\252>\275pK\215\276\322k\265=\222k\236\274\350\212M>\332z\355\274S\000\263=e\036\316\275\n\014\001\276\372Y]>\025\312f<;\0221\275\"\245\014\276\006\224\007\276&U\274\275%\352\016\273\312\260I\276tW\354\275\272\323*=\272o{\276\334\336\205<\332R\206<\366\342\251=\246\363->\254M\016=\030\312\222=\007g\233<}$\225\274\021ay\276\357$Y\276\337g\226\274Oe\266\274\034\252\252;\037\024\236=\320\016\230\275\031 \243\275V\023F>\350\271\346=\334\n$>?\201o\276\214\374\013\276`\242w>\315O\271\275\\\334\220\2751`\206\275]\302\262=\327\220\036;\332\377\256\275\235\237\352=IA|=\302I]\275\364T\275\275<bm<s\216!>\262\312#>?\360\020\276\005\033\007\275\tA!\276e\263\301\274\337\021S\276;\240\"\276kZ\272=Ho\264\275\273N\334\275\204\220\t>\346\016\252\275\271\253\375=9:\246=\363\001\260\275\377\361!\275\003\256\251>\262\371\345\275\272Z@\276}\210\027\276:\221T>\206U\376<\031VB=#(@\272\026\312\305<k\016\033\276\346\250\002>a\212=\275\357\205\034>?\221\267=\317\332\220\272\366\334\373\275\364\226Z\276\001\373\261=\244\261\002\2768\023I\274\350\351e\276\177\236\177>\215cx\275*Y8\276\225\020\031\276\354\253\237<\353\271\261\275\023\316N=\265;\035\275(\036\317=qY\252\276i>h\276D\254u<\017\2669\275`\377\261\274\033\257y\275\357\001\014>\375\036<\276\257\010P\276\027\222\002<\220m\375\275oW\216:\205@\250=\005$\227\273C\030K=j\2220<\037\362\034\276\317S0=\227\324\346\275\374\204H\274Y\005\251\275\004(o\275\341\020\376\273\004\317*>\234\317z\275\231:O=oM\375=8Vz>s6\r>\246P\030\276\212\204==\350\013\306\275(\300\r>\263\002\307\274\315N\237=\215&h<\217s\241=_V2\276\327\257Y>[5\233\274w\331U>\372\276y>\252b\303\275\322W\'>0\350+=\033\3240>b?\250=\231|\202>N\003\326=\367]\273=\216DL=sn\205\275\310\341G\275\263\332\200\275\013\374/\275\340\214l\275\211?\036\276\265\344\036>`g\264\274\223\"?\276n\013\333=\361\272\225<\330\036\365<\026\005\023>\024\225U=\034\301\225\276&\357t\276\036?T\273\343o\027\276R\372\r\276\354\242\202>\377\321\024=us\274\275\345\335\245\274\304\236\270>\024O\031>\206C\222\276pN\224\275\330\342C\275\236\020\366\275U\244\270=\tN >E&\311\273X\n,>s\347Q=\022\2204<%\350\010>4\343B=S\310\355\273\005\236{>`5\010>\366\267\341<d\264H<\252\336\241\275\277!\254\275\212c\246\275\351\322\004>\344\3631>\264\003\305=\225[2<\257\262\376<\254\274\247\274\303t\210\275\240i\233<\0362\006\276\323\037\271\274ul\316;\266\305\372\275\270\030\363\274\216\021R=\236\314|<\230\315\016\276\316)\371\275\036^\265\274i\034\260=\346\" \276GV\210\275\377\314\014\275\313C\200\275\205\007\326<\355\360\332;\374E\301\273\023\036(:f\276\337\275\207\352d=\305\255\r\276\247\350~\274d\334\220\275)\303\\>\202\232E\275\353k%<Q\017\230\275\2205O>\216JT\276Hn\020=j\203\233>>\354\262=A\303\254;\020\212\223>(\236\037=\307\252q=\243\'\372\273\013\2217\275\032\221\245\274\2461\r\275H~^\276\277\315\217=\300!\255=\247t\366=\353\207w\276(?\360=\n5\201\276\345\350\352\275_\331\201\276\316\362m\276\312\313;\276\353\003\245\275S\3064\276\245#g>\211Y\373=}oF=}\2553\276\207\177?=h\225\330\275\213\022X\275\245\003\221=\321\332\000\275\261s\t>\266\001\037\275\256\277\255\276\235\023\376<\230\200\t>\031\236\006\2768\323\251>\006\226\244=\276\342\202=\324t\004\276\300!$\275\373\201\355\275\230X\177<o\371\353\275\305o\260<\246\344\237\274B6\335\272\313L\363\275o\276\031\276\311\222\211\275\312\242R\273\363\336N>\032u\320=\224u\320<\020\245\006>\340\366\000\276a\313\261\275\305L\177>\n\371!\276n\266\253=Bg\234\275\177a\310=f\034G=\"N0\274\206x\021\275\357w\240\272\223L2\275\323\177\255<33\277\275\231*r<R\017\303\274\004\200\205>\314\034J\275zij\276(3t\275W\225\372\275\323\354\200=\036\326\251\275L!A>w\227\227<\006r\316\274\003\303\300<Z\351\311\275b\004\201<\302A+=\212\357\315\276\214\300\034\275\203JQ\274\td<\276\000X\223=G\376E\276aA\020\276#\245\303\275P\315(\276\301,\177<\204\'t\275a\023\240=|\366\316\273.\311\212=\252/\212\275\353O\244=\2443U\276\367\253F>\331,\307=\241N\213\276\201*\262\2759R\312=\237\020\000\276\371\3030>Z#h=j\266\007=+\364O\274f<7\2768p\034\276\372\363 <O\246\t>\361w\227=\345\177\313=\177\nG>\220a\330\275\337\231p\275\325~\016\2767^\347\275\224\323\037<\265\207\327=&t\215>\201\024q\275+\002\265=Y@!=\321\310l\276\020,\'=\027\317\311\275LF:\274Zu\357=2\3451>5\\\302\274\255\367\027<N\212C\276\033;S\275\270\263\031>\373\356Y\274\310\356\037=\353h\200\276\261\303R=\233\262\211\276\265\303j\275\345\314\210\275\352\031\356\274\272\305r\276\260\376E:\353\345q\276$Q\250=MV\271=7\200\010\276\260C\201\276Q\336\375<\376\277\320\275\210&\035\276j4\251\275>\200\004>Ac\035\276\336L\333\274\3719!\276\324h\377\274\027\334\336\275L\357\007>\"\1772=\372\025#\276\241\256,>k_\262\274\317o\312\274\334\320\326<J\325\210\275\240\374\344=\355\366A>\241[\004>\367\352\354=\352\236\215>3\t\237\275\335\3776>@}\300\275oU\242>\370\352I>\254Q^\275bB\214=\307*\255>N3\004<-\363\344=Q\375\260\274\227FO>\220\001\254;${(=\202-\331=/\220\207\275\255\220\216\275s\0316>\317\032\227=9\017\023>[\267&=\357\014\347<\342\372(\273\335\366\305\273\363\224Z<\330\234\006=&^\235<\250\3142\275\227\016\'>\236/\244\274\r\232\035\274\364\220\007>\215\265\213\275]\240)\275\255\265\316\275\335\307\364\275\2700\366\275\324R\277<q\262D=\333M\262\275\254\301\013>\357\260?=\354`G<X\340\324<O\245\317\275\314\177\024>\326\305\311\275s\231F\276\212\357\366\275\257O\312=\215\242O>\255\336\211\276\037&\221\275\216\3043\275\022]\342\275\013\354\351\275\242c\267=M\246\276=\242\3160=M*Q>\350\004\t\276G\321\251\275\207\336\022=\323\257\313\274P\335b=m[\001\276)\320\261\275\300\2275\276\020\340\273\274p\275H\275\222\332\n\276\264\234&\276\303|-\275\017H\244=\326\n\013>\223\033u\276\363\021\027<(\237D\276\227*\"=\365K\\\276G\312\261\276\376\003)=\026\3708\275:q\254<\226\270\177=\300\266\245=\304n\275>\222\367(>\2620s\275*\251#\273\361\206\300=\276\255\321\274\267\177\234<\264\007\325\275d\005\226\275\'q\312\275Z\t-=g\317\200=\374\276X\275\244\263\233=\324|r>m\261\332\275\331B4>\375Ih>\201{\240=\360\340\014>Ag\204>\263 \244\274\225\021\346=\026S\014>,a\313=,\353\317=+\323\304=\375\033#\274\262\304\255\275}\302z=g\3715\275\242Wk\276\312\341\020\276(\"\362=\240\316\327\275\311\303\317=\275\013\027>c@{\275FK0>\343\304]\275\304\035\214\275J\325\305>\033\2510\276\256\204\366\275\255\324\'\274)\231\361=\224\013\311=@J\312<\254\355K=\273\006\325\274\351\257@\273\217\344\213<\255\205\332\275\210z\327:\233\033\321\275\337\320P>P\356K\276%m[<\217\325\265=\234T\227=\352@\033\276\210\223\274\275D\351)\274\341\203\302\275\353&|>~\221:\276\301\027G\276\346\364q\274+\246\236\275\204=\217=9\317\277\274\346\341\036\276\211A\253\274W\226\276\274dTW>\374\334\201>\3112\032=0\226\030\273c\r\031\276\tS\035\276j}f=\354\2616<\202\032%=\363|\364\274\201{\'\276\345\257\362\275\241v\344=Gf\247=\253\321\316=MW\357\274k\354\205>\320\3726\275\260\036\204\276F\2332=\356\323\233<\001\245/=\374JP=\214\305\220\274\322r\027\275\013\334|>Q\221\216\275\245r\335=o\206\035=\360\242l\276\251\233\235>\006\241&\276M\256\352\275\227\007\217\275\376\253\224\275\261\036P>\25527>8W\030\275\251\323\314\275\265,S\274\377o\214<\242\313\307<\036\324\246\275\325\274\214<\200\035->U\034\205>\027}\367=bv\016>i\245\262=\270\367#\275`\253\354\275\376S\">\331\342\016=\241\302\314=g\231W\273nH5\276g\363O\274$\273H\276\327\243\234\276\211Cs\276/\273\347<\3578\255=\007oR=c\306\376;4\312\200=<g\212>`2d\274J\255 \276\r\243\020\276E\0245\274k\366\021\276\372\2434>.\336F>\202\314\013>\273\032\316=\315\206B>z\351\367=A\004/;\212\261\006>t\251\021<\212\272R=2\305l\275\022O\245\275ol(>\324\255}\275\301\321\376< \233\210=\0262e\276$\255\005\276\352\036\312\275\\\352\013\275\330\311b;\301\275\013>\2636\014\276\336\177\375\275;\177\377\275\206\036\004>\275\213\261=~}\327=\327\367\203=1\032\005=\242\376\266=\206r\023\276\244\346\361\275-\004#=\234,0>W\327?=\017\1777\276\306\203\007\276H+\220=\2762\004\276\314\334\204\276\375\225\222\276\221\357[<\372<\016\275\235\2461>\341\232Z>\234\346\357\275\34236<\006\232\370\274|\347\007\276j\332\250\274\205\"\364=\026j\252;\177p\030=\253\036|\275V\277\311=7\336\033\276\320\314M=\033\003\302=\377O\275\275\206\003\n\276\2302\000\276\035\363\374\275T\246.\276q\266\224\275\333o\210>~\033\034\276\277\220\367\274\004\026\007\276N+\302\275\232f0\275\2075\374\275\375\007@>\3444\n>]l5\276x\274q\275g\330\272=\005F\375;\256\250D;\326\027\313;z\310\331\274z\260*>\037fw\275\021\273\261=\310\026^>\330\324.\275\3353\205>[\253f<(\030^\276d1!\275hK4\276\021\\\252=\033\243N\275\336v\227\2722B\022\276\352\246\325==\275\274\275\030Fk\275\027\325t>h|\217\275r\010\204\276\013 \207>\207\310\235\274\033\354\255=J#\235\2768B>;\342\024\206\275\231\273\002\275g\370\353\274\376\375\205\2748a\346=\036\222\234=v\361\221\276.x\343\275\034K\242\273J\263\213<D\245K\275P\037\035>\256,\322<g\330\266<mN\024\275\303\352R=\177\224;>\370L\024>\000y\277\275\031N\273=\272b\000\275\3661\225\275\025s\013\2746\263?\276\3222:<tJ\007\275\th\264\275\002i\235\275z:\223>\377.:\276aS%>\340\243\272\275o\272\001\275\223\304-\276w\353\350\275$\313\327=\364\005\276;0\317\207=TO\002>\347\232f\276;_\024>-\nY>\342\n\025>\302\004B\276A\243U\276}\343\007>\247h\r>\027\342+\275\332\377\316\275\206\301h\275\251\177\237=5\270R\276HoS=0M\232=\220\344x\2748\253\273\2752\225@=#\005\305\273\177\315k\275x\247\016\273\210%F\275w\216Z\276=4\256\274NC\240<S\330\037\274\316>\\\276\272\341\324\275,\203\300\275\344\270\321\275\226\264\237=Tw\200>`nT\275\007\021\322=@\2146=\226\002\200\276\t\2173<\232\265\021\275\357\014\034\275;\013\233>\320[\312\275z\346\003\276k\\L\275\342\257\322\2753\377\224=}\3664>\304[\275;}?K\276H\361\310\274\037\035\200\276\340\324\217\275\245:\327=\227\004n>\367\357\353\275B\256\013\276\300=P\276P\233\013>R\021\t\276U\2348\275E\"\025=\373\034\246\275\372\'\213\2765.\253=\244\337k=c,\311\275\337E\310\275\356\252\333\274\022$\373\275U6i\276p!+>\025^\354\274\232\364T\276\033\223Z\275\237\331e=\005\245A\275e\367\224\273"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/Shape_1"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_11/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/strided_slice_11/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_11/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_11"
  op: "StridedSlice"
  input: "net/Shape_1"
  input: "net/strided_slice_11/stack"
  input: "net/strided_slice_11/stack_1"
  input: "net/strided_slice_11/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/Shape_2"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_12/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_12/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_12/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_12"
  op: "StridedSlice"
  input: "net/Shape_2"
  input: "net/strided_slice_12/stack"
  input: "net/strided_slice_12/stack_1"
  input: "net/strided_slice_12/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones/packed"
  op: "Pack"
  input: "net/strided_slice_12"
  input: "net/strided_slice_11"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "net/ones/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones"
  op: "Fill"
  input: "net/ones/packed"
  input: "net/ones/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.20000000298023224
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value/Minimum"
  op: "Minimum"
  input: "net/add_1"
  input: "net/Const_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value"
